app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "あい"], ["body", "あい"], ["user_id", 1], ["created_at", "2020-08-01 07:49:43.065785"], ["updated_at", "2020-08-01 07:49:43.065785"]]
SELECT "books".* FROM "books"
---
  def create
    @book_new = Book.new(book_params)
    @book_new.user_id = current_user.id
    if @book_new.save
      redirect_to book_path(@book_new), notice: "You have created book successfully."
    else
      @books = Book.all